installation/README.md

# Table of Contents

1.  [What will you learn?](#org36d8890)
2.  [Glossary](#org49a5757)
3.  [Install Ubuntu under Windows 10](#orga8a2001)
4.  [Install a compiler](#orgc83dfee)
5.  [References](#org5510b81)



<a id="org36d8890"></a>

# What will you learn?

> "It's nostalgic to edit, build and run C programs in text mode, but
> it works well and is quite efficient." --[Dan Gookin](#orgf60a038)

-   Install Ubuntu under Windows 10
-   Install a compiler
-   Basic shell commands
-   Choose a text editor
-   Finding your code
-   Compiling and running

Source: [Gookin, chapter 1](#orgf60a038)


<a id="org49a5757"></a>

# Glossary

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Compiler">Compiler</a></td>
<td class="org-left">Software to turn source code into executable code</td>
</tr>


<tr>
<td class="org-left">Shell</td>
<td class="org-left">Software to control your computer from the command line (using text)</td>
</tr>


<tr>
<td class="org-left">Editor</td>
<td class="org-left">Software to create and edit source code (as a text document)</td>
</tr>


<tr>
<td class="org-left">Ubuntu</td>
<td class="org-left">Popular Linux distribution or "distro"</td>
</tr>
</tbody>
</table>


<a id="orga8a2001"></a>

# Install Ubuntu under Windows 10

The easiest way to get hold of C. [See this FAQ](https://github.com/birkenkrahe/org/blob/master/FAQ.md#how-can-i-install-linux-under-windows-10) on how to download
and run Ubuntu for free as an app from the Microsoft store under
Windows.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Time</td>
<td class="org-left">ca. 15 min.</td>
</tr>
</tbody>
</table>


<a id="orgc83dfee"></a>

# Install a compiler


<a id="org5510b81"></a>

# References

<a id="org34b01e9"></a> King (2008). C Programming - A Modern
Approach. Norton. [Online: knking.com](http://knking.com/books/c2/index.html).

<a id="org7903a8f"></a> Kernighan/Ritchie (1978). The C Programming
Language. Prentice Hall. [Online: wikipedia.org](https://en.wikipedia.org/wiki/The_C_Programming_Language).

<a id="orgc835cff"></a> Lemonaki, Dionysia (November 4, 2021). C vs. C++ -
What's The Difference [blog]. URL: [freecodecamp.org.](https://www.freecodecamp.org/news/c-vs-cpp-whats-the-difference/)

<a id="orgf60a038"></a> Gookin D (2021). Tiny C Projects. Manning.

